OdDAI.GlobalRule.expression
\details
Returns an expression of the Where Rule.
\returns Returns an expression of the Where Rule.

OdDAI.GlobalRule.whereRules
\details
Retrieves a Where Rules list associated with the Named Type.
\returns Returns a list of pointers to associated Where Rules.

OdDAI.GlobalRule.validate(OdSmartPtr&lt;OdDAI.Model&gt;,OdDAI.List&lt;OdAnsiString&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details

OdDAI.GlobalRule.getAttr(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Retrieves the current value of an attribute specified by its name.
\param attrName [in] An ANSI string that contains the attribute name.
\returns Returns the current value of the attribute.
\remarks
The method provides the late binding access to the attribute value by its name.
Attributes of select and aggregate data types are also supported.

OdDAI.GlobalRule.parentSchema
\details
Returns a raw pointer to parent Schema instance.

OdDAI.GlobalRule.entities
\details
Retrieves an array of entity definitions for which global rule to be applied.
\returns Returns an OdArray of smart pointers to Entity instances.

OdDAI.GlobalRule.originalName
\details
Returns an original label of the Where Rule in form which it presents in schema.

OdDAI.GlobalRule.name
\details
Returns a label of the Where Rule.

OdDAI.GlobalRule.Dispose
\details
Destructor.

OdDAI.GlobalRule
\details
This class represents a Global Rule for model validation pourposes.